zephyrproject-rtos/hal_nxp/dts/nxp/mcx/mcxe/pinctrl/MCXE246VLH-pinctrl.h
/*
 * NOTE: Autogenerated file by gen_soc_headers.py
 * for MCXE246VLH/signal_configuration.xml
 *
 * Copyright 2025 NXP
 * SPDX-License-Identifier: Apache-2.0
 */

/*
 * Delta-deduplicated by dedup_pinctrl.py:
 * based on MCXE247VLQ-pinctrl.h with this part's differences applied
 * below (348 removed, 0 changed,
 * 0 added). Regenerate with dedup_pinctrl.py;
 * do not edit by hand.
 * target-hash: a37fc56c898e6e9f
 */

#ifndef _ZEPHYR_DTS_BINDING_MCXE246VLH_WRAPPER_
#define _ZEPHYR_DTS_BINDING_MCXE246VLH_WRAPPER_

#include "MCXE247VLQ-pinctrl.h"

/* Signals not present on this part */
#undef ADC0_SE16_PTB18
#undef ADC0_SE17_PTB20
#undef ADC0_SE18_PTB21
#undef ADC0_SE19_PTB22
#undef ADC0_SE20_PTB23
#undef ADC0_SE21_PTB25
#undef ADC0_SE22_PTB27
#undef ADC0_SE23_PTB28
#undef ADC0_SE24_PTB29
#undef ADC0_SE25_PTC19
#undef ADC0_SE26_PTC23
#undef ADC0_SE27_PTC27
#undef ADC0_SE28_PTC28
#undef ADC0_SE29_PTC29
#undef ADC0_SE30_PTC30
#undef ADC0_SE31_PTC31
#undef ADC0_SE9_PTB14
#undef ADC1_SE12_PTA15
#undef ADC1_SE13_PTA16
#undef ADC1_SE14_PTB15
#undef ADC1_SE15_PTB16
#undef ADC1_SE16_PTD18
#undef ADC1_SE17_PTD19
#undef ADC1_SE18_PTD22
#undef ADC1_SE19_PTD23
#undef ADC1_SE20_PTD24
#undef ADC1_SE21_PTD27
#undef ADC1_SE22_PTD28
#undef ADC1_SE23_PTD29
#undef ADC1_SE24_PTD30
#undef ADC1_SE25_PTE19
#undef ADC1_SE26_PTE20
#undef ADC1_SE27_PTE21
#undef ADC1_SE28_PTE22
#undef ADC1_SE29_PTE23
#undef ADC1_SE30_PTE24
#undef ADC1_SE31_PTE25
#undef ADC1_SE9_PTB14
#undef CAN0_RX_PTA28
#undef CAN0_TX_PTA27
#undef CAN2_RX_PTE25
#undef CAN2_TX_PTE24
#undef CLKOUT_PTD10
#undef CLKOUT_PTD14
#undef ENET_TMR0_PTD14
#undef ENET_TMR1_PTD13
#undef ENET_TMR2_PTD15
#undef ENET_TMR3_PTE9
#undef ETM_TRACE_CLKOUT_PTC2
#undef ETM_TRACE_CLKOUT_PTD16
#undef ETM_TRACE_D0_PTD0
#undef ETM_TRACE_D0_PTD7
#undef ETM_TRACE_D1_PTD12
#undef ETM_TRACE_D1_PTE4
#undef ETM_TRACE_D2_PTD11
#undef ETM_TRACE_D2_PTD16
#undef ETM_TRACE_D3_PTD10
#undef ETM_TRACE_D3_PTD15
#undef EWM_IN_PTA14
#undef EWM_OUT_b_PTA17
#undef FTM0_CH2_PTB14
#undef FTM0_CH3_PTB15
#undef FTM0_CH4_PTB16
#undef FTM0_CH5_PTB17
#undef FTM0_CH6_PTA17
#undef FTM0_FLT0_PTA14
#undef FTM0_FLT1_PTE14
#undef FTM0_FLT2_PTD17
#undef FTM0_FLT3_PTE12
#undef FTM1_CH2_PTA15
#undef FTM1_CH3_PTA16
#undef FTM1_CH4_PTD8
#undef FTM1_CH5_PTD9
#undef FTM1_FLT0_PTA14
#undef FTM1_FLT3_PTA9
#undef FTM2_CH0_PTD10
#undef FTM2_CH1_PTD11
#undef FTM2_CH2_PTD12
#undef FTM2_CH4_PTD13
#undef FTM2_CH5_PTD14
#undef FTM2_CH6_PTC12
#undef FTM2_CH6_PTE15
#undef FTM2_CH7_PTC13
#undef FTM2_CH7_PTE16
#undef FTM2_FLT0_PTE13
#undef FTM2_FLT1_PTE14
#undef FTM2_FLT2_PTD8
#undef FTM2_FLT3_PTD9
#undef FTM2_QD_PHA_PTD11
#undef FTM2_QD_PHB_PTD10
#undef FTM3_CH0_PTB8
#undef FTM3_CH1_PTB9
#undef FTM3_CH2_PTB10
#undef FTM3_CH3_PTB11
#undef FTM3_CH4_PTC10
#undef FTM3_CH5_PTC11
#undef FTM3_CH6_PTC12
#undef FTM3_CH7_PTC13
#undef FTM3_FLT0_PTA17
#undef FTM3_FLT1_PTA14
#undef FTM3_FLT2_PTA9
#undef FTM3_FLT3_PTA8
#undef FTM4_CH0_PTE20
#undef FTM4_CH1_PTE21
#undef FTM4_CH2_PTC11
#undef FTM4_CH2_PTE22
#undef FTM4_CH3_PTE23
#undef FTM4_CH4_PTC27
#undef FTM4_CH4_PTE24
#undef FTM4_CH5_PTE13
#undef FTM4_CH5_PTE25
#undef FTM4_CH7_PTC28
#undef FTM4_FLT0_PTA9
#undef FTM4_FLT0_PTE16
#undef FTM4_FLT1_PTA8
#undef FTM4_FLT1_PTE15
#undef FTM5_CH0_PTA25
#undef FTM5_CH1_PTA26
#undef FTM5_CH2_PTA27
#undef FTM5_CH2_PTC29
#undef FTM5_CH3_PTA28
#undef FTM5_CH4_PTA29
#undef FTM5_CH4_PTC30
#undef FTM5_CH5_PTA30
#undef FTM5_CH6_PTA31
#undef FTM5_CH6_PTC31
#undef FTM5_CH7_PTB18
#undef FTM5_CH7_PTD18
#undef FTM5_FLT0_PTA17
#undef FTM5_FLT0_PTE12
#undef FTM5_FLT1_PTB17
#undef FTM5_FLT1_PTD17
#undef FTM6_CH0_PTB20
#undef FTM6_CH0_PTD19
#undef FTM6_CH1_PTB21
#undef FTM6_CH2_PTB22
#undef FTM6_CH3_PTB23
#undef FTM6_CH3_PTD22
#undef FTM6_CH4_PTD23
#undef FTM6_CH5_PTB25
#undef FTM6_CH5_PTD24
#undef FTM6_CH7_PTB27
#undef FTM6_FLT0_PTB13
#undef FTM6_FLT1_PTB12
#undef FTM6_FLT1_PTD30
#undef FTM7_CH0_PTB28
#undef FTM7_CH0_PTD27
#undef FTM7_CH1_PTB29
#undef FTM7_CH1_PTD28
#undef FTM7_CH2_PTD29
#undef FTM7_CH3_PTD30
#undef FTM7_CH5_PTC19
#undef FTM7_CH7_PTE19
#undef FTM7_FLT0_PTA15
#undef FTM7_FLT1_PTE6
#undef FXIO_D0_PTC30
#undef FXIO_D0_PTD9
#undef FXIO_D1_PTC31
#undef FXIO_D1_PTD8
#undef FXIO_D2_PTD18
#undef FXIO_D2_PTE15
#undef FXIO_D3_PTD19
#undef FXIO_D3_PTE16
#undef FXIO_D6_PTA8
#undef FXIO_D7_PTA9
#undef LPI2C0_HREQ_PTB11
#undef LPI2C0_SCLS_PTB9
#undef LPI2C0_SDAS_PTB10
#undef LPI2C1_HREQ_PTC5
#undef LPI2C1_HREQ_PTD12
#undef LPI2C1_SCLS_PTA13
#undef LPI2C1_SCLS_PTC17
#undef LPI2C1_SCLS_PTD18
#undef LPI2C1_SCL_PTD19
#undef LPI2C1_SCL_PTD9
#undef LPI2C1_SCL_PTE1
#undef LPI2C1_SDAS_PTA12
#undef LPI2C1_SDAS_PTC16
#undef LPI2C1_SDAS_PTC30
#undef LPI2C1_SDA_PTC31
#undef LPI2C1_SDA_PTD8
#undef LPI2C1_SDA_PTE0
#undef LPSPI0_PCS0_PTA26
#undef LPSPI0_PCS1_PTA31
#undef LPSPI0_PCS3_PTA15
#undef LPSPI0_SCK_PTC23
#undef LPSPI0_SOUT_PTA30
#undef LPSPI1_PCS0_PTA26
#undef LPSPI1_PCS1_PTB18
#undef LPSPI1_PCS2_PTA16
#undef LPSPI1_PCS3_PTB17
#undef LPSPI1_SCK_PTA28
#undef LPSPI1_SCK_PTB14
#undef LPSPI1_SIN_PTA29
#undef LPSPI1_SIN_PTB15
#undef LPSPI1_SOUT_PTA27
#undef LPSPI1_SOUT_PTB16
#undef LPSPI2_PCS0_PTA9
#undef LPSPI2_PCS0_PTB25
#undef LPSPI2_PCS1_PTC19
#undef LPSPI2_PCS2_PTE13
#undef LPSPI2_PCS3_PTA15
#undef LPSPI2_SCK_PTB29
#undef LPSPI2_SCK_PTE15
#undef LPSPI2_SIN_PTB28
#undef LPSPI2_SIN_PTE16
#undef LPSPI2_SOUT_PTA8
#undef LPSPI2_SOUT_PTB27
#undef LPUART0_RX_PTA28
#undef LPUART0_TX_PTA27
#undef LPUART1_CTS_PTE15
#undef LPUART1_RTS_PTE16
#undef LPUART1_RX_PTB23
#undef LPUART1_RX_PTD13
#undef LPUART1_TX_PTB22
#undef LPUART1_TX_PTD14
#undef LPUART2_CTS_PTC12
#undef LPUART2_CTS_PTD11
#undef LPUART2_RTS_PTC13
#undef LPUART2_RTS_PTD12
#undef LPUART2_RX_PTA30
#undef LPUART2_RX_PTA8
#undef LPUART2_RX_PTD17
#undef LPUART2_TX_PTA29
#undef LPUART2_TX_PTA9
#undef LPUART2_TX_PTE12
#undef MII_COL_PTB23
#undef MII_COL_PTC14
#undef MII_CRS_PTB22
#undef MII_CRS_PTC15
#undef MII_RMII_MDC_PTB5
#undef MII_RMII_MDC_PTE8
#undef MII_RMII_MDIO_PTB4
#undef MII_RMII_RXD0_PTC0
#undef MII_RMII_RXD0_PTC1
#undef MII_RMII_RXD1_PTC0
#undef MII_RMII_RXD1_PTC1
#undef MII_RMII_RX_DV_PTC17
#undef MII_RMII_RX_ER_PTC16
#undef MII_RMII_TXD0_PTC2
#undef MII_RMII_TXD1_PTD7
#undef MII_RMII_TX_CLK_PTD11
#undef MII_RMII_TX_EN_PTD12
#undef MII_RXD2_PTD9
#undef MII_RXD3_PTD8
#undef MII_RX_CLK_PTD10
#undef MII_TXD2_PTD6
#undef MII_TXD3_PTD5
#undef MII_TX_ER_PTC3
#undef PTA14
#undef PTA15
#undef PTA16
#undef PTA17
#undef PTA25
#undef PTA26
#undef PTA27
#undef PTA28
#undef PTA29
#undef PTA30
#undef PTA31
#undef PTA8
#undef PTA9
#undef PTB10
#undef PTB11
#undef PTB14
#undef PTB15
#undef PTB16
#undef PTB17
#undef PTB18
#undef PTB20
#undef PTB21
#undef PTB22
#undef PTB23
#undef PTB25
#undef PTB27
#undef PTB28
#undef PTB29
#undef PTB8
#undef PTB9
#undef PTC10
#undef PTC11
#undef PTC12
#undef PTC13
#undef PTC19
#undef PTC23
#undef PTC27
#undef PTC28
#undef PTC29
#undef PTC30
#undef PTC31
#undef PTD10
#undef PTD11
#undef PTD12
#undef PTD13
#undef PTD14
#undef PTD17
#undef PTD18
#undef PTD19
#undef PTD22
#undef PTD23
#undef PTD24
#undef PTD27
#undef PTD28
#undef PTD29
#undef PTD30
#undef PTD8
#undef PTD9
#undef PTE12
#undef PTE13
#undef PTE14
#undef PTE15
#undef PTE16
#undef PTE19
#undef PTE20
#undef PTE21
#undef PTE22
#undef PTE23
#undef PTE24
#undef PTE25
#undef QSPI_A_CS_PTC3
#undef QSPI_A_IO0_PTD11
#undef QSPI_A_IO1_PTD7
#undef QSPI_A_IO2_PTD12
#undef QSPI_A_IO3_PTC2
#undef QSPI_A_SCK_PTD10
#undef QSPI_B_CS_PTC15
#undef QSPI_B_IO0_PTB4
#undef QSPI_B_IO1_PTD6
#undef QSPI_B_IO2_PTD5
#undef QSPI_B_IO3_PTC3
#undef QSPI_B_RWDS_PTC0
#undef QSPI_B_SCK_PTC1
#undef RTC_CLKOUT_PTD13
#undef SAI0_BCLK_PTA12
#undef SAI0_D0_PTA13
#undef SAI0_D1_PTE1
#undef SAI0_D2_PTE0
#undef SAI0_D3_PTA14
#undef SAI0_MCLK_PTD1
#undef SAI0_SYNC_PTA11
#undef SAI1_BCLK_PTB8
#undef SAI1_D0_PTB9
#undef SAI1_MCLK_PTB10
#undef SAI1_SYNC_PTE2
#undef TRGMUX_IN10_PTC11
#undef TRGMUX_IN11_PTC10
#undef TRGMUX_OUT6_PTE15
#undef TRGMUX_OUT7_PTE16

#endif /* _ZEPHYR_DTS_BINDING_MCXE246VLH_WRAPPER_ */
